// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// for (let i = 20; i <= 30; i += 0.5) {
//     document.write(`${i} ,`)
// }
// debugger

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// arr = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
// defaultValue = 27;
// for (let i = 0; i < arr.length; i++) {
//     res = defaultValue * arr[i]
//     console.log(res);
// }

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// number = 750;
// for (let i = 1; i <= 100; i++) {
//     res = i * i;
//     if (res <= number) {
//         console.log(res);
//     }
// }

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// n = 10;
// i = 2

// while (i < n) {
//     i++;
//     if (n % i !== 0) {
//         console.log('Это число простое');
//     }
// }

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь
// Не певен чи вірно реалізувава завдання. Буду вдячен за фідбєк
i = 0;
number = 81;

while (i <= 10) {
    i++;
    if (3 ** i === number) {
        console.log('це число можна одержати шляхом зведення числа 3 у деякий ступінь');
    }
}